###################################################################

# Created by write_sdc on Tue Mar 19 20:32:00 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports in_clka]
set_driving_cell -lib_cell INVX1 [get_ports in_clkb]
set_driving_cell -lib_cell INVX1 [get_ports in_restart]
set_driving_cell -lib_cell INVX1 [get_ports {in_mult[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_mult[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_mult[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_mult[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_mult[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_incr[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_incr[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_incr[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_incr[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_incr[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_n_mines[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_n_mines[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_n_mines[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_n_mines[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_n_mines[0]}]
set_driving_cell -lib_cell INVX1 [get_ports in_place]
set_driving_cell -lib_cell INVX1 [get_ports in_data_in]
set_driving_cell -lib_cell INVX1 [get_ports {in_data[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_data[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_data[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_data[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {in_data[0]}]
create_clock -name vclk  -period 50  -waveform {0 25}
set_input_delay -clock vclk  1  [get_ports in_clka]
set_input_delay -clock vclk  1  [get_ports in_clkb]
set_input_delay -clock vclk  1  [get_ports in_restart]
set_input_delay -clock vclk  1  [get_ports {in_mult[4]}]
set_input_delay -clock vclk  1  [get_ports {in_mult[3]}]
set_input_delay -clock vclk  1  [get_ports {in_mult[2]}]
set_input_delay -clock vclk  1  [get_ports {in_mult[1]}]
set_input_delay -clock vclk  1  [get_ports {in_mult[0]}]
set_input_delay -clock vclk  1  [get_ports {in_incr[4]}]
set_input_delay -clock vclk  1  [get_ports {in_incr[3]}]
set_input_delay -clock vclk  1  [get_ports {in_incr[2]}]
set_input_delay -clock vclk  1  [get_ports {in_incr[1]}]
set_input_delay -clock vclk  1  [get_ports {in_incr[0]}]
set_input_delay -clock vclk  1  [get_ports {in_n_mines[4]}]
set_input_delay -clock vclk  1  [get_ports {in_n_mines[3]}]
set_input_delay -clock vclk  1  [get_ports {in_n_mines[2]}]
set_input_delay -clock vclk  1  [get_ports {in_n_mines[1]}]
set_input_delay -clock vclk  1  [get_ports {in_n_mines[0]}]
set_input_delay -clock vclk  1  [get_ports in_place]
set_input_delay -clock vclk  1  [get_ports in_data_in]
set_input_delay -clock vclk  1  [get_ports {in_data[4]}]
set_input_delay -clock vclk  1  [get_ports {in_data[3]}]
set_input_delay -clock vclk  1  [get_ports {in_data[2]}]
set_input_delay -clock vclk  1  [get_ports {in_data[1]}]
set_input_delay -clock vclk  1  [get_ports {in_data[0]}]
set_output_delay -clock vclk  1  [get_ports {out_state_main[3]}]
set_output_delay -clock vclk  1  [get_ports {out_state_main[2]}]
set_output_delay -clock vclk  1  [get_ports {out_state_main[1]}]
set_output_delay -clock vclk  1  [get_ports {out_state_main[0]}]
set_output_delay -clock vclk  1  [get_ports out_start]
set_output_delay -clock vclk  1  [get_ports out_place_done]
set_output_delay -clock vclk  1  [get_ports {out_mines[24]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[23]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[22]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[21]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[20]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[19]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[18]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[17]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[16]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[15]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[14]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[13]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[12]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[11]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[10]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[9]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[8]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[7]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[6]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[5]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[4]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[3]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[2]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[1]}]
set_output_delay -clock vclk  1  [get_ports {out_mines[0]}]
set_output_delay -clock vclk  1  [get_ports out_load]
set_output_delay -clock vclk  1  [get_ports {out_temp_data_in[4]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_data_in[3]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_data_in[2]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_data_in[1]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_data_in[0]}]
set_output_delay -clock vclk  1  [get_ports out_decode]
set_output_delay -clock vclk  1  [get_ports out_alu]
set_output_delay -clock vclk  1  [get_ports out_alu_done]
set_output_delay -clock vclk  1  [get_ports out_gameover]
set_output_delay -clock vclk  1  [get_ports out_win]
set_output_delay -clock vclk  1  [get_ports {out_global_score[31]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[30]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[29]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[28]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[27]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[26]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[25]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[24]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[23]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[22]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[21]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[20]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[19]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[18]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[17]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[16]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[15]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[14]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[13]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[12]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[11]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[10]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[9]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[8]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[7]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[6]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[5]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[4]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[3]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[2]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[1]}]
set_output_delay -clock vclk  1  [get_ports {out_global_score[0]}]
set_output_delay -clock vclk  1  [get_ports {out_n_nearby[1]}]
set_output_delay -clock vclk  1  [get_ports {out_n_nearby[0]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[24]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[23]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[22]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[21]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[20]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[19]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[18]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[17]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[16]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[15]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[14]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[13]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[12]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[11]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[10]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[9]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[8]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[7]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[6]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[5]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[4]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[3]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[2]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[1]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_decoded[0]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[24]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[23]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[22]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[21]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[20]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[19]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[18]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[17]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[16]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[15]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[14]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[13]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[12]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[11]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[10]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[9]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[8]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[7]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[6]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[5]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[4]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[3]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[2]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[1]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_cleared[0]}]
set_output_delay -clock vclk  1  [get_ports out_display]
set_output_delay -clock vclk  1  [get_ports out_display_done]
set_output_delay -clock vclk  1  [get_ports {out_temp_index[4]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_index[3]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_index[2]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_index[1]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_index[0]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_mine_cnt[4]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_mine_cnt[3]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_mine_cnt[2]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_mine_cnt[1]}]
set_output_delay -clock vclk  1  [get_ports {out_temp_mine_cnt[0]}]
